* TODO jupyter notebook setup
** TODO installer add rdkit python package
** TODO installer add rdkit python dependent package
   pillow
   see: ttps://nbviewer.jupyter.org/gist/greglandrum/4316430
** TODO add /etc/ld.so.conf.d/qtplatz.conf for rdkit/boost python import

** TODO jupyter -- rdkit python dependency: sudopip3 install pycairo

Calibration date:	2020-02-19T20:15:15.428879+0900	id	fca9afc0-d6a1-4516-99d6-3435b252b31e

\[
\sqrt{ m/z } = 	a + b\cdot X^1
, where a = -0.07818211844942, b = 589251.56835260125808
\]

without Na2F
#+PLOT: se:"xlabel 'Time'" ind:11 deps:(1)
| time(us) | formula          |         m/z(exact) |                m/z |         error(mDa) |    m/z(calibrated) | error(mDa) calibrated | enable | delta m/z |          Intensity | sqrt(m / z(exact)) | fcn | index |
|  13.7103 | Na2F             |      64.9779417818 |  64.01138866465713 | -966.5531171428654 |  64.01010561220079 |    -967.8361695992095 | false  |         0 |  4534.310465494791 |          8.0608896 |   0 |    10 |
|  13.8162 |                  |                    |  65.01386149064928 |                    |  65.01254199738425 |                       |        |         1 |  173.9597981770833 |                  0 |   0 |    11 |
|  14.6382 |                  |                    |   73.0600818278916 |                    |   73.0584653527289 |                       |        |         9 | 152.59423828124994 |                  0 |   0 |    14 |
|  15.5987 |                  |                    |   83.0555597844324 |                    |  83.05356508798575 |                       |        |        19 |    334.34619140625 |                  0 |   0 |    19 |
|   16.319 |                  |                    |  90.97239189991755 |                    |  90.97009141062493 |                       |        |        27 |  351.8776041666667 |                  0 |   0 |    25 |
|  17.5255 |                  |                    | 105.03928582238548 |                    | 105.03643077209446 |                       |        |        41 |    865.72900390625 |                  0 |   0 |    30 |
|  18.5739 | C5H11NO2[H]+     | 118.08625504885056 |  118.0847276088465 | -1.527440004053915 |  118.0813474590418 |    -4.907589808766488 | false  |        54 | 425.67366536458337 |          10.866750 |   0 |    37 |
|  20.2174 |                  |                    | 140.07010871673634 |                    | 140.06582468902874 |                       |        |        76 |  92.22949218749999 |                  0 |   0 |    45 |
|  21.5295 | (CF3COONa)1[Na]+ | 158.96402888101056 | 158.96896684367974 |  4.937962669174567 | 158.96389039347636 |  -0.13848753420120374 | true   |        95 |  8801.278401692707 |          12.608094 |   0 |    53 |
|  21.5969 |                  |                    | 159.97252578556387 |                    | 159.96740692459582 |                       |        |        96 | 208.84033203124997 |                  0 |   0 |    54 |
|  24.1323 |                  |                    | 199.99751127918404 |                    | 199.99067681274906 |                       |        |       136 | 1290.1936848958333 |                  0 |   0 |    74 |
|  24.9638 |                  |                    |  214.0968886062391 |                    | 214.08944037100883 |                       |        |       150 | 399.55729166666674 |                  0 |   0 |    81 |
|  25.6988 |                  |                    |  226.9592802745382 |                    | 226.95126848626424 |                       |        |       163 |  252.0462239583332 |                  0 |   0 |    90 |
|  26.2075 |                  |                    | 236.08008424060176 |                    |  236.0716709248278 |                       |        |       172 | 1230.5003255208333 |                  0 |   0 |    95 |
|  26.2628 |                  |                    |  237.0831714291702 |                    |  237.0747138275661 |                       |        |       173 |  142.1741536458334 |                  0 |   0 |    97 |
|  28.3825 |                  |                    | 277.10817036371435 |                    |  277.0979334478854 |                       |        |       213 | 223.54085286458323 |                  0 |   0 |   112 |
|  29.2778 | (CF3COONa)2[Na]+ |  294.9388370610306 | 294.95011329260456 |  11.27623157395874 |  294.9390755543005 |    0.2384932698760167 | true   |       231 | 2477.9329427083335 |          17.173783 |   0 |   116 |
|  29.3273 |                  |                    | 295.95280699142216 |                    | 295.94172412635726 |                       |        |       232 | 114.72753906249999 |                  0 |   0 |   119 |
|  30.5877 | C6H18N3O6P3[H]+  | 322.04812165118057 |  322.0601454022554 |  12.02375107482112 | 322.04788317690094 |   -0.2384742796266437 | false  |       258 | 125.98876953125004 |          17.945699 |   0 |   132 |
|  31.2389 |                  |                    | 335.97838471402116 |                    | 335.96549056585303 |                       |        |       272 |            401.375 |                  0 |   0 |   136 |
|  32.4629 |                  |                    | 362.94061506769236 |                    | 362.92649100917816 |                       |        |       299 | 221.11946614583334 |                  0 |   0 |   140 |
|  32.8666 |                  |                    | 372.06071973015145 |                    |  372.0461780616982 |                       |        |       308 |  96.62630208333333 |                  0 |   0 |   143 |
|  35.3612 | (CF3COONa)3[Na]+ |  430.9136452410506 |  430.9309330249798 | 17.287783929248235 | 430.91367868061036 |  0.033439559786074824 | true   |       367 | 1731.8308919270833 |          20.758460 |   0 |   152 |
|  35.4022 |                  |                    | 431.93432401089535 |                    | 431.91702317245256 |                       |        |       368 |  120.1502278645834 |                  0 |   0 |   154 |
|  37.0001 |                  |                    |  471.9596649142697 |                    |  471.9405046936513 |                       |        |       408 | 209.96191406249997 |                  0 |   0 |   160 |
|  38.0385 |                  |                    |   498.921335804612 |                    |  498.9009172354255 |                       |        |       435 | 127.96972656249993 |                  0 |   0 |   162 |
|  40.5389 | (CF3COONa)4[Na]+ |  566.8884534210706 |  566.9121847320213 |  23.73131095066583 |  566.8885747908954 |   0.12136982479660219 | true   |       503 |  946.7887369791665 |          23.809419 |   0 |   170 |
|  41.9755 |                  |                    |  607.9405013402363 |                    |  607.9149545182082 |                       |        |       544 |  92.64127604166683 |                  0 |   0 |   174 |
|  42.8933 |                  |                    |   634.903115753959 |                    |  634.8762920406169 |                       |        |       571 |  96.50341796875006 |                  0 |   0 |   176 |
|  45.1246 | (CF3COONa)5[Na]+ |  702.8632616010906 |  702.8930631011012 |  29.80150001064885 |  702.8630067858612 |   -0.2548152293684325 | true   |       639 |  577.6240234375001 |          26.511568 |   0 |   182 |
#+TBLFM: $11=sqrt($3)
